# Shells
brew "fish"
brew "bash"

# Core
brew "git"
brew "stow"

# Classic tools
brew "coreutils"
brew "direnv"
brew "expect"
brew "make"
brew "nmap"
brew "parallel"
brew "socat"
brew "telnet"
brew "watch"
brew "wget"
brew "worktrunk"

# Modern tools
brew "age"
brew "btop"
brew "chafa"
brew "csview"
brew "duckdb"
brew "eza"
brew "fd"
brew "fzf"
brew "gum"
brew "git-delta"
brew "glow"
brew "hck"
brew "hwatch"
brew "imagemagick"
brew "jo"
brew "jq"
brew "lazygit", args: ["HEAD"]
brew "mise"
brew "ouch"
brew "poppler"
brew "procs"
brew "resvg"
brew "ripgrep"
brew "scooter"
brew "sd"
brew "shfmt"
brew "slides", args: ["HEAD"]
brew "terminal-notifier"
brew "tokei"
brew "trivy"
brew "xh"
brew "yazi"
brew "yt-dlp"
brew "zet"
brew "zoxide"

# Editor
# brew "helix", args: ["HEAD"]
brew "tmux"
brew "dprint"
brew "marksman"
brew "superhtml"
brew "vscode-langservers-extracted"

# Apps
cask "ghostty@tip"
cask "docker-desktop"
cask "imageoptim"
cask "tableplus"

# AI
cask "claude-code"
cask "droid"
