# Font
tap "homebrew/cask-fonts"
cask "font-fira-code-nerd-font"

# Git
brew "git"

# Shell
brew "fish"
brew "bash"

# Manage dotfiles
brew "stow"

# Classic tools
brew "make"
brew "nmap"
brew "socat"
brew "telnet"
brew "watch"
brew "parallel"
brew "wget"

# Modern tools
brew "rtx"
brew "direnv"
brew "tealdeer"
brew "ripgrep"
brew "eza"
brew "fd"
brew "broot"
brew "sd"
brew "ouch"
brew "lazygit"
brew "procs"
brew "bat"
brew "xh"
brew "git-delta"
brew "tokei"

# Editor
brew "helix", args: ["HEAD"]

# Apps
cask "kitty"
cask "docker"
cask "tableplus"
